Autodesk.AdvanceSteel.ExternalDb.ASModelProxy.UpdateObjects(System.Collections.Generic.IList`1{Autodesk.AdvanceSteel.ExternalDb.FilerObjectSaveDescriptor})
Modify objects according to the given information.
The ids of those objects and their relations are expected to be valid ids from the current model
objects: objects that are treated as existing model objects, needing to be modified
Modify objects according to the given information.
The ids of those objects and their relations are expected to be valid ids from the current model
objects: objects that are treated as existing model objects, needing to be modified

Autodesk.AdvanceSteel.ExternalDb.ASModelProxy.GetOldNewHandlesMap
When new objects are added to the model, it is very likely they will receive new ids, different from the
ones they had. If this matters, calling this method will return the mapping from the old to the new ids
When new objects are added to the model, it is very likely they will receive new ids, different from the
ones they had. If this matters, calling this method will return the mapping from the old to the new ids

Autodesk.AdvanceSteel.ExternalDb.ASModelProxy.AddNewObjects(System.Collections.Generic.IList`1{Autodesk.AdvanceSteel.ExternalDb.FilerObjectSaveDescriptor})
Adds new objects to the Advance Steel model.
The set of objects to be created need to be complete and consistent:
The objects relations need to point either to other new objects in this set or to
valid objects already existing in the model
objects: objects that are treated as new, needing to be created in the model
Adds new objects to the Advance Steel model.
The set of objects to be created need to be complete and consistent:
The objects relations need to point either to other new objects in this set or to
valid objects already existing in the model
objects: objects that are treated as new, needing to be created in the model